torvalds/linux/drivers/net/wireless/realtek/rtlwifi/rtl8723ae/reg.h
#define IMR8190_DISABLED      0x0
#define IMR_BCNDMAINT6        BIT(31)
#define IMR_BCNDMAINT5        BIT(30)
#define IMR_BCNDMAINT4        BIT(29)
#define IMR_BCNDMAINT3        BIT(28)
#define IMR_BCNDMAINT2        BIT(27)
#define IMR_BCNDMAINT1        BIT(26)
#define IMR_BCNDOK8         BIT(25)
#define IMR_BCNDOK7         BIT(24)
#define IMR_BCNDOK6         BIT(23)
#define IMR_BCNDOK5         BIT(22)
#define IMR_BCNDOK4         BIT(21)
#define IMR_BCNDOK3         BIT(20)
#define IMR_BCNDOK2         BIT(19)
#define IMR_BCNDOK1         BIT(18)
#define IMR_TIMEOUT2        BIT(17)
#define IMR_TIMEOUT1        BIT(16)
#define IMR_TXFOVW          BIT(15)
#define IMR_PSTIMEOUT       BIT(14)
#define IMR_BCNINT          BIT(13)
#define IMR_RXFOVW          BIT(12)
#define IMR_RDU           BIT(11)
#define IMR_ATIMEND         BIT(10)
#define IMR_BDOK          BIT(9)
#define IMR_HIGHDOK         BIT(8)
#define IMR_TBDOK         BIT(7)
#define IMR_MGNTDOK         BIT(6)
#define IMR_TBDER         BIT(5)
#define IMR_BKDOK         BIT(4)
#define IMR_BEDOK         BIT(3)
#define IMR_VIDOK         BIT(2)
#define IMR_VODOK         BIT(1)
#define IMR_ROK           BIT(0)

#define IMR_TXERR         BIT(11)
#define IMR_RXERR         BIT(10)
#define IMR_CPWM          BIT(8)
#define IMR_OCPINT          BIT(1)
#define IMR_WLANOFF         BIT(0)

/* 8723E series PCIE Host IMR/ISR bit
 * IMR DW0 Bit 0-31*/
#define PHIMR_TIMEOUT2          BIT(31)
#define PHIMR_TIMEOUT1          BIT(30)
#define PHIMR_PSTIMEOUT       BIT(29)
#define PHIMR_GTINT4          BIT(28)
#define PHIMR_GTINT3          BIT(27)
#define PHIMR_TXBCNERR          BIT(26)
#define PHIMR_TXBCNOK         BIT(25)
#define PHIMR_TSF_BIT32_TOGGLE      BIT(24)
#define PHIMR_BCNDMAINT3        BIT(23)
#define PHIMR_BCNDMAINT2        BIT(22)
#define PHIMR_BCNDMAINT1        BIT(21)
#define PHIMR_BCNDMAINT0        BIT(20)
#define PHIMR_BCNDOK3         BIT(19)
#define PHIMR_BCNDOK2         BIT(18)
#define PHIMR_BCNDOK1         BIT(17)
#define PHIMR_BCNDOK0         BIT(16)
#define PHIMR_HSISR_IND_ON      BIT(15)
#define PHIMR_BCNDMAINT_E       BIT(14)
#define PHIMR_ATIMEND_E       BIT(13)
#define PHIMR_ATIM_CTW_END      BIT(12)
#define PHIMR_HISRE_IND       BIT(11)
#define PHIMR_C2HCMD          BIT(10)
#define PHIMR_CPWM2         BIT(9)
#define PHIMR_CPWM          BIT(8)
#define PHIMR_HIGHDOK         BIT(7)
#define PHIMR_MGNTDOK         BIT(6)
#define PHIMR_BKDOK         BIT(5)
#define PHIMR_BEDOK         BIT(4)
#define PHIMR_VIDOK         BIT(3)
#define PHIMR_VODOK         BIT(2)
#define PHIMR_RDU           BIT(1)
#define PHIMR_ROK           BIT(0)

/* PCIE Host Interrupt Status Extension bit */
#define PHIMR_BCNDMAINT7        BIT(23)
#define PHIMR_BCNDMAINT6        BIT(22)
#define PHIMR_BCNDMAINT5        BIT(21)
#define PHIMR_BCNDMAINT4        BIT(20)
#define PHIMR_BCNDOK7         BIT(19)
#define PHIMR_BCNDOK6         BIT(18)
#define PHIMR_BCNDOK5         BIT(17)
#define PHIMR_BCNDOK4         BIT(16)
/* bit12-15: RSVD */
#define PHIMR_TXERR         BIT(11)
#define PHIMR_RXERR         BIT(10)
#define PHIMR_TXFOVW          BIT(9)
#define PHIMR_RXFOVW          BIT(8)
/* bit2-7: RSVD */
#define PHIMR_OCPINT          BIT(1)

#define HWSET_MAX_SIZE        256
#define EFUSE_MAX_SECTION     32
#define EFUSE_REAL_CONTENT_LEN      512
#define EFUSE_OOB_PROTECT_BYTES     15

#define EEPROM_DEFAULT_TSSI         0x0
#define EEPROM_DEFAULT_TXPOWERDIFF      0x0
#define EEPROM_DEFAULT_CRYSTALCAP     0x5
#define EEPROM_DEFAULT_BOARDTYPE      0x02
#define EEPROM_DEFAULT_TXPOWER        0x1010
#define EEPROM_DEFAULT_HT2T_TXPWR     0x10

#define EEPROM_DEFAULT_LEGACYHTTXPOWERDIFF  0x3
#define EEPROM_DEFAULT_THERMALMETER     0x12
#define EEPROM_DEFAULT_ANTTXPOWERDIFF   0x0
#define EEPROM_DEFAULT_TXPWDIFF_CRYSTALCAP  0x5
#define EEPROM_DEFAULT_TXPOWERLEVEL     0x22
#define EEPROM_DEFAULT_HT40_2SDIFF      0x0
#define EEPROM_DEFAULT_HT20_DIFF      2
#define EEPROM_DEFAULT_LEGACYHTTXPOWERDIFF  0x3
#define EEPROM_DEFAULT_HT40_PWRMAXOFFSET  0
#define EEPROM_DEFAULT_HT20_PWRMAXOFFSET  0

#define EEPROM_DEFAULT_PID          0x1234
#define EEPROM_DEFAULT_VID          0x5678
#define EEPROM_DEFAULT_CUSTOMERID     0xAB
#define EEPROM_DEFAULT_SUBCUSTOMERID    0xCD
#define EEPROM_DEFAULT_VERSION        0

#define EEPROM_CHANNEL_PLAN_FCC       0x0
#define EEPROM_CHANNEL_PLAN_IC        0x1
#define EEPROM_CHANNEL_PLAN_ETSI      0x2
#define EEPROM_CHANNEL_PLAN_SPAIN     0x3
#define EEPROM_CHANNEL_PLAN_FRANCE      0x4
#define EEPROM_CHANNEL_PLAN_MKK       0x5
#define EEPROM_CHANNEL_PLAN_MKK1      0x6
#define EEPROM_CHANNEL_PLAN_ISRAEL      0x7
#define EEPROM_CHANNEL_PLAN_TELEC     0x8
#define EEPROM_CHANNEL_PLAN_GLOBAL_DOMAIN 0x9
#define EEPROM_CHANNEL_PLAN_WORLD_WIDE_13 0xA
#define EEPROM_CHANNEL_PLAN_NCC       0xB
#define EEPROM_CHANNEL_PLAN_BY_HW_MASK    0x80

#define EEPROM_CID_DEFAULT          0x0
#define EEPROM_CID_TOSHIBA          0x4
#define EEPROM_CID_CCX            0x10
#define EEPROM_CID_QMI            0x0D
#define EEPROM_CID_WHQL           0xFE

#define RTL8192_EEPROM_ID         0x8129

#define RTL8190_EEPROM_ID         0x8129
#define EEPROM_HPON             0x02
#define EEPROM_CLK              0x06
#define EEPROM_TESTR            0x08

#define EEPROM_VID              0x49
#define EEPROM_DID              0x4B
#define EEPROM_SVID             0x4D
#define EEPROM_SMID             0x4F

#define EEPROM_MAC_ADDR           0x67

#define EEPROM_CCK_TX_PWR_INX       0x5A
#define EEPROM_HT40_1S_TX_PWR_INX     0x60
#define EEPROM_HT40_2S_TX_PWR_INX_DIFF    0x66
#define EEPROM_HT20_TX_PWR_INX_DIFF     0x69
#define EEPROM_OFDM_TX_PWR_INX_DIFF     0x6C
#define EEPROM_HT40_MAX_PWR_OFFSET      0x25
#define EEPROM_HT20_MAX_PWR_OFFSET      0x22

#define EEPROM_THERMAL_METER        0x2a
#define EEPROM_XTAL_K           0x78
#define EEPROM_RF_OPT1            0x79
#define EEPROM_RF_OPT2            0x7A
#define EEPROM_RF_OPT3            0x7B
#define EEPROM_RF_OPT4            0x7C
#define EEPROM_CHANNEL_PLAN         0x28
#define EEPROM_VERSION            0x30
#define EEPROM_CUSTOMER_ID          0x31

#define EEPROM_PWRDIFF        0x54

