torvalds/linux/drivers/net/wireless/realtek/rtlwifi/rtl8723ae/reg.h
#define EEPROM_TXPOWERCCK     0x10
#define EEPROM_TXPOWERHT40_1S   0x16
#define EEPROM_TXPOWERHT40_2SDIFF 0x66
#define EEPROM_TXPOWERHT20DIFF    0x1C
#define EEPROM_TXPOWER_OFDMDIFF   0x1F

#define EEPROM_TXPWR_GROUP      0x22

#define EEPROM_TSSI_A       0x29
#define EEPROM_TSSI_B       0x77

#define EEPROM_CHANNELPLAN      0x28

#define RF_OPTION1          0x2B
#define RF_OPTION2          0x2C
#define RF_OPTION3          0x2D
#define RF_OPTION4          0x2E

#define STOPBECON         BIT(6)
#define STOPHIGHT         BIT(5)
#define STOPMGT           BIT(4)
#define STOPVO            BIT(3)
#define STOPVI            BIT(2)
#define STOPBE            BIT(1)
#define STOPBK            BIT(0)

#define RCR_APPFCS          BIT(31)
#define RCR_APP_MIC         BIT(30)
#define RCR_APP_ICV         BIT(29)
#define RCR_APP_PHYST_RXFF      BIT(28)
#define RCR_APP_BA_SSN        BIT(27)
#define RCR_ENMBID          BIT(24)
#define RCR_LSIGEN          BIT(23)
#define RCR_MFBEN         BIT(22)
#define RCR_HTC_LOC_CTRL      BIT(14)
#define RCR_AMF           BIT(13)
#define RCR_ACF           BIT(12)
#define RCR_ADF           BIT(11)
#define RCR_AICV          BIT(9)
#define RCR_ACRC32          BIT(8)
#define RCR_CBSSID_BCN        BIT(7)
#define RCR_CBSSID_DATA       BIT(6)
#define RCR_CBSSID          RCR_CBSSID_DATA
#define RCR_APWRMGT         BIT(5)
#define RCR_ADD3          BIT(4)
#define RCR_AB            BIT(3)
#define RCR_AM            BIT(2)
#define RCR_APM           BIT(1)
#define RCR_AAP           BIT(0)
#define RCR_MXDMA_OFFSET      8
#define RCR_FIFO_OFFSET       13

#define RSV_CTRL          0x001C
#define RD_CTRL           0x0524

#define REG_USB_INFO        0xFE17
#define REG_USB_SPECIAL_OPTION    0xFE55
#define REG_USB_DMA_AGG_TO      0xFE5B
#define REG_USB_AGG_TO        0xFE5C
#define REG_USB_AGG_TH        0xFE5D

#define REG_USB_VID         0xFE60
#define REG_USB_PID         0xFE62
#define REG_USB_OPTIONAL      0xFE64
#define REG_USB_CHIRP_K       0xFE65
#define REG_USB_PHY         0xFE66
#define REG_USB_MAC_ADDR      0xFE70
#define REG_USB_HRPWM       0xFE58
#define REG_USB_HCPWM       0xFE57

#define SW18_FPWM         BIT(3)

#define ISO_MD2PP         BIT(0)
#define ISO_UA2USB          BIT(1)
#define ISO_UD2CORE         BIT(2)
#define ISO_PA2PCIE         BIT(3)
#define ISO_PD2CORE         BIT(4)
#define ISO_IP2MAC          BIT(5)
#define ISO_DIOP          BIT(6)
#define ISO_DIOE          BIT(7)
#define ISO_EB2CORE         BIT(8)
#define ISO_DIOR          BIT(9)

#define PWC_EV25V         BIT(14)
#define PWC_EV12V         BIT(15)

#define FEN_BBRSTB          BIT(0)
#define FEN_BB_GLB_RSTN       BIT(1)
#define FEN_USBA          BIT(2)
#define FEN_UPLL          BIT(3)
#define FEN_USBD          BIT(4)
#define FEN_DIO_PCIE        BIT(5)
#define FEN_PCIEA         BIT(6)
#define FEN_PPLL          BIT(7)
#define FEN_PCIED         BIT(8)
#define FEN_DIOE          BIT(9)
#define FEN_CPUEN         BIT(10)
#define FEN_DCORE         BIT(11)
#define FEN_ELDR          BIT(12)
#define FEN_DIO_RF          BIT(13)
#define FEN_HWPDN         BIT(14)
#define FEN_MREGEN          BIT(15)

#define PFM_LDALL         BIT(0)
#define PFM_ALDN          BIT(1)
#define PFM_LDKP          BIT(2)
#define PFM_WOWL          BIT(3)
#define ENPDN           BIT(4)
#define PDN_PL            BIT(5)
#define APFM_ONMAC          BIT(8)
#define APFM_OFF          BIT(9)
#define APFM_RSM          BIT(10)
#define AFSM_HSUS         BIT(11)
#define AFSM_PCIE         BIT(12)
#define APDM_MAC          BIT(13)
#define APDM_HOST         BIT(14)
#define APDM_HPDN         BIT(15)
#define RDY_MACON         BIT(16)
#define SUS_HOST          BIT(17)
#define ROP_ALD           BIT(20)
#define ROP_PWR           BIT(21)
#define ROP_SPS           BIT(22)
#define SOP_MRST          BIT(25)
#define SOP_FUSE          BIT(26)
#define SOP_ABG           BIT(27)
#define SOP_AMB           BIT(28)
#define SOP_RCK           BIT(29)
#define SOP_A8M           BIT(30)
#define XOP_BTCK          BIT(31)

#define ANAD16V_EN          BIT(0)
#define ANA8M           BIT(1)
#define MACSLP            BIT(4)
#define LOADER_CLK_EN       BIT(5)
#define _80M_SSC_DIS        BIT(7)
#define _80M_SSC_EN_HO        BIT(8)
#define PHY_SSC_RSTB        BIT(9)
#define SEC_CLK_EN          BIT(10)
#define MAC_CLK_EN          BIT(11)
#define SYS_CLK_EN          BIT(12)
#define RING_CLK_EN         BIT(13)

#define BOOT_FROM_EEPROM      BIT(4)
#define EEPROM_EN         BIT(5)

#define AFE_BGEN          BIT(0)
#define AFE_MBEN          BIT(1)
#define MAC_ID_EN         BIT(7)

#define WLOCK_ALL         BIT(0)
#define WLOCK_00          BIT(1)
#define WLOCK_04          BIT(2)
#define WLOCK_08          BIT(3)
#define WLOCK_40          BIT(4)
#define R_DIS_PRST_0        BIT(5)
#define R_DIS_PRST_1        BIT(6)
#define LOCK_ALL_EN         BIT(7)

#define RF_EN           BIT(0)
#define RF_RSTB           BIT(1)
#define RF_SDMRSTB          BIT(2)

#define LDA15_EN          BIT(0)
#define LDA15_STBY          BIT(1)
#define LDA15_OBUF          BIT(2)
#define LDA15_REG_VOS       BIT(3)
#define _LDA15_VOADJ(x)       (((x) & 0x7) << 4)

#define LDV12_EN          BIT(0)
#define LDV12_SDBY          BIT(1)
#define LPLDO_HSM         BIT(2)
#define LPLDO_LSM_DIS       BIT(3)
#define _LDV12_VADJ(x)        (((x) & 0xF) << 4)

#define XTAL_EN           BIT(0)
#define XTAL_BSEL         BIT(1)
#define _XTAL_BOSC(x)       (((x) & 0x3) << 2)
#define _XTAL_CADJ(x)       (((x) & 0xF) << 4)
#define XTAL_GATE_USB       BIT(8)
#define _XTAL_USB_DRV(x)      (((x) & 0x3) << 9)
#define XTAL_GATE_AFE       BIT(11)
#define _XTAL_AFE_DRV(x)      (((x) & 0x3) << 12)
#define XTAL_RF_GATE        BIT(14)
#define _XTAL_RF_DRV(x)       (((x) & 0x3) << 15)
#define XTAL_GATE_DIG       BIT(17)
#define _XTAL_DIG_DRV(x)      (((x) & 0x3) << 18)
#define XTAL_BT_GATE        BIT(20)
#define _XTAL_BT_DRV(x)       (((x) & 0x3) << 21)
#define _XTAL_GPIO(x)       (((x) & 0x7) << 23)

#define CKDLY_AFE         BIT(26)
#define CKDLY_USB         BIT(27)
#define CKDLY_DIG         BIT(28)
#define CKDLY_BT          BIT(29)

