torvalds/linux/drivers/net/wireless/realtek/rtlwifi/rtl8723ae/reg.h
#define APLL_EN           BIT(0)
#define APLL_320_EN         BIT(1)
#define APLL_FREF_SEL       BIT(2)
#define APLL_EDGE_SEL       BIT(3)
#define APLL_WDOGB          BIT(4)
#define APLL_LPFEN          BIT(5)

#define APLL_REF_CLK_13MHZ      0x1
#define APLL_REF_CLK_19_2MHZ    0x2
#define APLL_REF_CLK_20MHZ      0x3
#define APLL_REF_CLK_25MHZ      0x4
#define APLL_REF_CLK_26MHZ      0x5
#define APLL_REF_CLK_38_4MHZ    0x6
#define APLL_REF_CLK_40MHZ      0x7

#define APLL_320EN          BIT(14)
#define APLL_80EN         BIT(15)
#define APLL_1MEN         BIT(24)

#define ALD_EN            BIT(18)
#define EF_PD           BIT(19)
#define EF_FLAG           BIT(31)

#define EF_TRPT           BIT(7)
#define LDOE25_EN         BIT(31)

#define RSM_EN            BIT(0)
#define TIMER_EN          BIT(4)

#define TRSW0EN           BIT(2)
#define TRSW1EN           BIT(3)
#define EROM_EN           BIT(4)
#define ENBT            BIT(5)
#define ENUART            BIT(8)
#define UART_910          BIT(9)
#define ENPMAC            BIT(10)
#define SIC_SWRST         BIT(11)
#define ENSIC           BIT(12)
#define SIC_23            BIT(13)
#define ENHDP           BIT(14)
#define SIC_LBK           BIT(15)

#define LED0PL            BIT(4)
#define LED1PL            BIT(12)
#define LED0DIS           BIT(7)

#define MCUFWDL_EN          BIT(0)
#define MCUFWDL_RDY         BIT(1)
#define FWDL_CHKSUM_RPT       BIT(2)
#define MACINI_RDY          BIT(3)
#define BBINI_RDY         BIT(4)
#define RFINI_RDY         BIT(5)
#define WINTINI_RDY         BIT(6)
#define CPRST           BIT(23)

#define XCLK_VLD          BIT(0)
#define ACLK_VLD          BIT(1)
#define UCLK_VLD          BIT(2)
#define PCLK_VLD          BIT(3)
#define PCIRSTB           BIT(4)
#define V15_VLD           BIT(5)
#define TRP_B15V_EN         BIT(7)
#define SIC_IDLE          BIT(8)
#define BD_MAC2           BIT(9)
#define BD_MAC1           BIT(10)
#define IC_MACPHY_MODE        BIT(11)
#define BT_FUNC           BIT(16)
#define VENDOR_ID         BIT(19)
#define PAD_HWPD_IDN        BIT(22)
#define TRP_VAUX_EN         BIT(23)
#define TRP_BT_EN         BIT(24)
#define BD_PKG_SEL          BIT(25)
#define BD_HCI_SEL          BIT(26)
#define TYPE_ID           BIT(27)

#define CHIP_VER_RTL_MASK     0xF000
#define CHIP_VER_RTL_SHIFT      12

#define REG_LBMODE          (REG_CR + 3)

#define HCI_TXDMA_EN        BIT(0)
#define HCI_RXDMA_EN        BIT(1)
#define TXDMA_EN          BIT(2)
#define RXDMA_EN          BIT(3)
#define PROTOCOL_EN         BIT(4)
#define SCHEDULE_EN         BIT(5)
#define MACTXEN           BIT(6)
#define MACRXEN           BIT(7)
#define ENSWBCN           BIT(8)
#define ENSEC           BIT(9)

#define _NETTYPE(x)         (((x) & 0x3) << 16)
#define MASK_NETTYPE        0x30000
#define NT_NO_LINK          0x0
#define NT_LINK_AD_HOC        0x1
#define NT_LINK_AP          0x2
#define NT_AS_AP          0x3

#define _LBMODE(x)          (((x) & 0xF) << 24)
#define MASK_LBMODE         0xF000000
#define LOOPBACK_NORMAL       0x0
#define LOOPBACK_IMMEDIATELY    0xB
#define LOOPBACK_MAC_DELAY      0x3
#define LOOPBACK_PHY        0x1
#define LOOPBACK_DMA        0x7

#define GET_RX_PAGE_SIZE(value)   ((value) & 0xF)
#define GET_TX_PAGE_SIZE(value)   (((value) & 0xF0) >> 4)
#define _PSRX_MASK          0xF
#define _PSTX_MASK          0xF0
#define _PSRX(x)          (x)
#define _PSTX(x)          ((x) << 4)

#define PBP_64            0x0
#define PBP_128           0x1
#define PBP_256           0x2
#define PBP_512           0x3
#define PBP_1024          0x4

#define RXDMA_ARBBW_EN        BIT(0)
#define RXSHFT_EN         BIT(1)
#define RXDMA_AGG_EN        BIT(2)
#define QS_VO_QUEUE         BIT(8)
#define QS_VI_QUEUE         BIT(9)
#define QS_BE_QUEUE         BIT(10)
#define QS_BK_QUEUE         BIT(11)
#define QS_MANAGER_QUEUE      BIT(12)
#define QS_HIGH_QUEUE       BIT(13)

#define HQSEL_VOQ         BIT(0)
#define HQSEL_VIQ         BIT(1)
#define HQSEL_BEQ         BIT(2)
#define HQSEL_BKQ         BIT(3)
#define HQSEL_MGTQ          BIT(4)
#define HQSEL_HIQ         BIT(5)

#define _TXDMA_HIQ_MAP(x)     (((x) & 0x3) << 14)
#define _TXDMA_MGQ_MAP(x)     (((x) & 0x3) << 12)
#define _TXDMA_BKQ_MAP(x)     (((x) & 0x3) << 10)
#define _TXDMA_BEQ_MAP(x)     (((x) & 0x3) << 8)
#define _TXDMA_VIQ_MAP(x)     (((x) & 0x3) << 6)
#define _TXDMA_VOQ_MAP(x)     (((x) & 0x3) << 4)

#define QUEUE_LOW         1
#define QUEUE_NORMAL        2
#define QUEUE_HIGH          3

#define _LLT_NO_ACTIVE        0x0
#define _LLT_WRITE_ACCESS     0x1
#define _LLT_READ_ACCESS      0x2

#define _LLT_INIT_DATA(x)     ((x) & 0xFF)
#define _LLT_INIT_ADDR(x)     (((x) & 0xFF) << 8)
#define _LLT_OP(x)          (((x) & 0x3) << 30)
#define _LLT_OP_VALUE(x)      (((x) >> 30) & 0x3)

#define BB_WRITE_READ_MASK      (BIT(31) | BIT(30))
#define BB_WRITE_EN         BIT(30)
#define BB_READ_EN          BIT(31)

#define _HPQ(x)     ((x) & 0xFF)
#define _LPQ(x)     (((x) & 0xFF) << 8)
#define _PUBQ(x)    (((x) & 0xFF) << 16)
#define _NPQ(x)     ((x) & 0xFF)

#define HPQ_PUBLIC_DIS    BIT(24)
#define LPQ_PUBLIC_DIS    BIT(25)
#define LD_RQPN     BIT(31)

#define BCN_VALID   BIT(16)
#define BCN_HEAD(x)   (((x) & 0xFF) << 8)
#define BCN_HEAD_MASK   0xFF00

#define BLK_DESC_NUM_SHIFT      4
#define BLK_DESC_NUM_MASK     0xF

#define DROP_DATA_EN        BIT(9)

#define EN_AMPDU_RTY_NEW      BIT(7)

#define _INIRTSMCS_SEL(x)     ((x) & 0x3F)

#define _SPEC_SIFS_CCK(x)     ((x) & 0xFF)
#define _SPEC_SIFS_OFDM(x)      (((x) & 0xFF) << 8)

#define RATE_REG_BITMAP_ALL     0xFFFFF

#define _RRSC_BITMAP(x)       ((x) & 0xFFFFF)

#define _RRSR_RSC(x)        (((x) & 0x3) << 21)
#define RRSR_RSC_RESERVED     0x0
#define RRSR_RSC_UPPER_SUBCHANNEL 0x1
#define RRSR_RSC_LOWER_SUBCHANNEL 0x2
#define RRSR_RSC_DUPLICATE_MODE   0x3

#define USE_SHORT_G1        BIT(20)

#define _AGGLMT_MCS0(x)       ((x) & 0xF)
#define _AGGLMT_MCS1(x)       (((x) & 0xF) << 4)
#define _AGGLMT_MCS2(x)       (((x) & 0xF) << 8)
#define _AGGLMT_MCS3(x)       (((x) & 0xF) << 12)
#define _AGGLMT_MCS4(x)       (((x) & 0xF) << 16)
#define _AGGLMT_MCS5(x)       (((x) & 0xF) << 20)
#define _AGGLMT_MCS6(x)       (((x) & 0xF) << 24)
#define _AGGLMT_MCS7(x)       (((x) & 0xF) << 28)

