torvalds/linux/drivers/net/wireless/realtek/rtlwifi/rtl8723ae/reg.h
#define RETRY_LIMIT_SHORT_SHIFT   8
#define RETRY_LIMIT_LONG_SHIFT    0

#define _DARF_RC1(x)        ((x) & 0x1F)
#define _DARF_RC2(x)        (((x) & 0x1F) << 8)
#define _DARF_RC3(x)        (((x) & 0x1F) << 16)
#define _DARF_RC4(x)        (((x) & 0x1F) << 24)
#define _DARF_RC5(x)        ((x) & 0x1F)
#define _DARF_RC6(x)        (((x) & 0x1F) << 8)
#define _DARF_RC7(x)        (((x) & 0x1F) << 16)
#define _DARF_RC8(x)        (((x) & 0x1F) << 24)

#define _RARF_RC1(x)        ((x) & 0x1F)
#define _RARF_RC2(x)        (((x) & 0x1F) << 8)
#define _RARF_RC3(x)        (((x) & 0x1F) << 16)
#define _RARF_RC4(x)        (((x) & 0x1F) << 24)
#define _RARF_RC5(x)        ((x) & 0x1F)
#define _RARF_RC6(x)        (((x) & 0x1F) << 8)
#define _RARF_RC7(x)        (((x) & 0x1F) << 16)
#define _RARF_RC8(x)        (((x) & 0x1F) << 24)

#define AC_PARAM_TXOP_LIMIT_OFFSET  16
#define AC_PARAM_ECW_MAX_OFFSET   12
#define AC_PARAM_ECW_MIN_OFFSET   8
#define AC_PARAM_AIFS_OFFSET    0

#define _AIFS(x)          (x)
#define _ECW_MAX_MIN(x)       ((x) << 8)
#define _TXOP_LIMIT(x)        ((x) << 16)

#define _BCNIFS(x)          ((x) & 0xFF)
#define _BCNECW(x)          ((((x) & 0xF)) << 8)

#define _LRL(x)           ((x) & 0x3F)
#define _SRL(x)           (((x) & 0x3F) << 8)

#define _SIFS_CCK_CTX(x)      ((x) & 0xFF)
#define _SIFS_CCK_TRX(x)      (((x) & 0xFF) << 8)

#define _SIFS_OFDM_CTX(x)     ((x) & 0xFF)
#define _SIFS_OFDM_TRX(x)     (((x) & 0xFF) << 8)

#define _TBTT_PROHIBIT_HOLD(x)    (((x) & 0xFF) << 8)

#define DIS_EDCA_CNT_DWN      BIT(11)

#define EN_MBSSID         BIT(1)
#define EN_TXBCN_RPT        BIT(2)
#define EN_BCN_FUNCTION       BIT(3)

#define TSFTR_RST         BIT(0)
#define TSFTR1_RST          BIT(1)

#define STOP_BCNQ         BIT(6)

#define DIS_TSF_UDT0_NORMAL_CHIP  BIT(4)
#define DIS_TSF_UDT0_TEST_CHIP    BIT(5)

#define ACMHW_HWEN          BIT(0)
#define ACMHW_BEQEN         BIT(1)
#define ACMHW_VIQEN         BIT(2)
#define ACMHW_VOQEN         BIT(3)
#define ACMHW_BEQSTATUS       BIT(4)
#define ACMHW_VIQSTATUS       BIT(5)
#define ACMHW_VOQSTATUS       BIT(6)

#define APSDOFF           BIT(6)
#define APSDOFF_STATUS        BIT(7)

#define BW_20MHZ          BIT(2)

#define RATE_BITMAP_ALL       0xFFFFF

#define RATE_RRSR_CCK_ONLY_1M   0xFFFF1

#define TSFRST            BIT(0)
#define DIS_GCLK          BIT(1)
#define PAD_SEL           BIT(2)
#define PWR_ST            BIT(6)
#define PWRBIT_OW_EN        BIT(7)
#define ACRC            BIT(8)
#define CFENDFORM         BIT(9)
#define ICV             BIT(10)

#define AAP             BIT(0)
#define APM             BIT(1)
#define AM              BIT(2)
#define AB              BIT(3)
#define ADD3            BIT(4)
#define APWRMGT           BIT(5)
#define CBSSID            BIT(6)
#define CBSSID_DATA         BIT(6)
#define CBSSID_BCN          BIT(7)
#define ACRC32            BIT(8)
#define AICV            BIT(9)
#define ADF             BIT(11)
#define ACF             BIT(12)
#define AMF             BIT(13)
#define HTC_LOC_CTRL        BIT(14)
#define UC_DATA_EN          BIT(16)
#define BM_DATA_EN          BIT(17)
#define MFBEN           BIT(22)
#define LSIGEN            BIT(23)
#define ENMBID            BIT(24)
#define APP_BASSN         BIT(27)
#define APP_PHYSTS          BIT(28)
#define APP_ICV           BIT(29)
#define APP_MIC           BIT(30)
#define APP_FCS           BIT(31)

#define _MIN_SPACE(x)       ((x) & 0x7)
#define _SHORT_GI_PADDING(x)    (((x) & 0x1F) << 3)

#define RXERR_TYPE_OFDM_PPDU    0
#define RXERR_TYPE_OFDM_FALSE_ALARM 1
#define RXERR_TYPE_OFDM_MPDU_OK   2
#define RXERR_TYPE_OFDM_MPDU_FAIL 3
#define RXERR_TYPE_CCK_PPDU     4
#define RXERR_TYPE_CCK_FALSE_ALARM  5
#define RXERR_TYPE_CCK_MPDU_OK    6
#define RXERR_TYPE_CCK_MPDU_FAIL  7
#define RXERR_TYPE_HT_PPDU      8
#define RXERR_TYPE_HT_FALSE_ALARM 9
#define RXERR_TYPE_HT_MPDU_TOTAL  10
#define RXERR_TYPE_HT_MPDU_OK   11
#define RXERR_TYPE_HT_MPDU_FAIL   12
#define RXERR_TYPE_RX_FULL_DROP   15

#define RXERR_COUNTER_MASK      0xFFFFF
#define RXERR_RPT_RST       BIT(27)
#define _RXERR_RPT_SEL(type)    ((type) << 28)

#define SCR_TXUSEDK         BIT(0)
#define SCR_RXUSEDK         BIT(1)
#define SCR_TXENCENABLE       BIT(2)
#define SCR_RXDECENABLE       BIT(3)
#define SCR_SKBYA2          BIT(4)
#define SCR_NOSKMC          BIT(5)
#define SCR_TXBCUSEDK       BIT(6)
#define SCR_RXBCUSEDK       BIT(7)

#define USB_IS_HIGH_SPEED     0
#define USB_IS_FULL_SPEED     1
#define USB_SPEED_MASK        BIT(5)

#define USB_NORMAL_SIE_EP_MASK    0xF
#define USB_NORMAL_SIE_EP_SHIFT   4

#define USB_TEST_EP_MASK      0x30
#define USB_TEST_EP_SHIFT     4

#define USB_AGG_EN          BIT(3)

#define MAC_ADDR_LEN        6
#define LAST_ENTRY_OF_TX_PKT_BUFFER 255

#define POLLING_LLT_THRESHOLD   20
#define POLLING_READY_TIMEOUT_COUNT 1000

#define MAX_MSS_DENSITY_2T      0x13
#define MAX_MSS_DENSITY_1T      0x0A

#define EPROM_CMD_OPERATING_MODE_MASK ((1 << 7) | (1 << 6))
#define EPROM_CMD_CONFIG      0x3
#define EPROM_CMD_LOAD        1

#define HWSET_MAX_SIZE_92S      HWSET_MAX_SIZE

#define HAL_8192C_HW_GPIO_WPS_BIT BIT(2)

#define RPMAC_RESET         0x100
#define RPMAC_TXSTART       0x104
#define RPMAC_TXLEGACYSIG     0x108
#define RPMAC_TXHTSIG1        0x10c
#define RPMAC_TXHTSIG2        0x110
#define RPMAC_PHYDEBUG        0x114
#define RPMAC_TXPACKETNUM     0x118
#define RPMAC_TXIDLE        0x11c
#define RPMAC_TXMACHEADER0      0x120
#define RPMAC_TXMACHEADER1      0x124
#define RPMAC_TXMACHEADER2      0x128
#define RPMAC_TXMACHEADER3      0x12c
#define RPMAC_TXMACHEADER4      0x130
#define RPMAC_TXMACHEADER5      0x134
#define RPMAC_TXDADATYPE      0x138
#define RPMAC_TXRANDOMSEED      0x13c
#define RPMAC_CCKPLCPPREAMBLE   0x140
#define RPMAC_CCKPLCPHEADER     0x144
#define RPMAC_CCKCRC16        0x148
#define RPMAC_OFDMRXCRC32OK     0x170
#define RPMAC_OFDMRXCRC32ER     0x174
#define RPMAC_OFDMRXPARITYER    0x178
#define RPMAC_OFDMRXCRC8ER      0x17c
#define RPMAC_CCKCRXRC16ER      0x180
#define RPMAC_CCKCRXRC32ER      0x184
#define RPMAC_CCKCRXRC32OK      0x188
#define RPMAC_TXSTATUS        0x18c

