torvalds/linux/drivers/net/wireless/realtek/rtlwifi/rtl8723ae/reg.h
#define RFPGA0_RFMOD        0x800

#define RFPGA0_TXINFO       0x804
#define RFPGA0_PSDFUNCTION      0x808

#define RFPGA0_TXGAINSTAGE      0x80c

#define RFPGA0_RFTIMING1      0x810
#define RFPGA0_RFTIMING2      0x814

#define RFPGA0_XA_HSSIPARAMETER1  0x820
#define RFPGA0_XA_HSSIPARAMETER2  0x824
#define RFPGA0_XB_HSSIPARAMETER1  0x828
#define RFPGA0_XB_HSSIPARAMETER2  0x82c

#define RFPGA0_XA_LSSIPARAMETER   0x840
#define RFPGA0_XB_LSSIPARAMETER   0x844

#define RFPGA0_RFWAKEUPPARAMETER  0x850
#define RFPGA0_RFSLEEPUPPARAMETER 0x854

#define RFPGA0_XAB_SWITCHCONTROL  0x858
#define RFPGA0_XCD_SWITCHCONTROL  0x85c

#define RFPGA0_XA_RFINTERFACEOE   0x860
#define RFPGA0_XB_RFINTERFACEOE   0x864

#define RFPGA0_XAB_RFINTERFACESW  0x870
#define RFPGA0_XCD_RFINTERFACESW  0x874

#define RFPGA0_XAB_RFPARAMETER    0x878
#define RFPGA0_XCD_RFPARAMETER    0x87c

#define RFPGA0_ANALOGPARAMETER1   0x880
#define RFPGA0_ANALOGPARAMETER2   0x884
#define RFPGA0_ANALOGPARAMETER3   0x888
#define RFPGA0_ANALOGPARAMETER4   0x88c

#define RFPGA0_XA_LSSIREADBACK    0x8a0
#define RFPGA0_XB_LSSIREADBACK    0x8a4
#define RFPGA0_XC_LSSIREADBACK    0x8a8
#define RFPGA0_XD_LSSIREADBACK    0x8ac

#define RFPGA0_PSDREPORT      0x8b4
#define TRANSCEIVEA_HSPI_READBACK 0x8b8
#define TRANSCEIVEB_HSPI_READBACK 0x8bc
#define RFPGA0_XAB_RFINTERFACERB  0x8e0
#define RFPGA0_XCD_RFINTERFACERB  0x8e4

#define RFPGA1_RFMOD        0x900

#define RFPGA1_TXBLOCK        0x904
#define RFPGA1_DEBUGSELECT      0x908
#define RFPGA1_TXINFO       0x90c

#define RCCK0_SYSTEM        0xa00

#define RCCK0_AFESETTING      0xa04
#define RCCK0_CCA         0xa08

#define RCCK0_RXAGC1        0xa0c
#define RCCK0_RXAGC2        0xa10

#define RCCK0_RXHP          0xa14

#define RCCK0_DSPPARAMETER1     0xa18
#define RCCK0_DSPPARAMETER2     0xa1c

#define RCCK0_TXFILTER1       0xa20
#define RCCK0_TXFILTER2       0xa24
#define RCCK0_DEBUGPORT       0xa28
#define RCCK0_FALSEALARMREPORT    0xa2c
#define RCCK0_TRSSIREPORT   0xa50
#define RCCK0_RXREPORT      0xa54
#define RCCK0_FACOUNTERLOWER    0xa5c
#define RCCK0_FACOUNTERUPPER    0xa58

#define ROFDM0_LSTF         0xc00

#define ROFDM0_TRXPATHENABLE    0xc04
#define ROFDM0_TRMUXPAR       0xc08
#define ROFDM0_TRSWISOLATION    0xc0c

#define ROFDM0_XARXAFE        0xc10
#define ROFDM0_XARXIQIMBALANCE    0xc14
#define ROFDM0_XBRXAFE      0xc18
#define ROFDM0_XBRXIQIMBALANCE    0xc1c
#define ROFDM0_XCRXAFE      0xc20
#define ROFDM0_XCRXIQIMBANLANCE   0xc24
#define ROFDM0_XDRXAFE      0xc28
#define ROFDM0_XDRXIQIMBALANCE    0xc2c

#define ROFDM0_RXDETECTOR1      0xc30
#define ROFDM0_RXDETECTOR2      0xc34
#define ROFDM0_RXDETECTOR3      0xc38
#define ROFDM0_RXDETECTOR4      0xc3c

#define ROFDM0_RXDSP        0xc40
#define ROFDM0_CFOANDDAGC     0xc44
#define ROFDM0_CCADROPTHRESHOLD   0xc48
#define ROFDM0_ECCATHRESHOLD    0xc4c

#define ROFDM0_XAAGCCORE1     0xc50
#define ROFDM0_XAAGCCORE2     0xc54
#define ROFDM0_XBAGCCORE1     0xc58
#define ROFDM0_XBAGCCORE2     0xc5c
#define ROFDM0_XCAGCCORE1     0xc60
#define ROFDM0_XCAGCCORE2     0xc64
#define ROFDM0_XDAGCCORE1     0xc68
#define ROFDM0_XDAGCCORE2     0xc6c

#define ROFDM0_AGCPARAMETER1    0xc70
#define ROFDM0_AGCPARAMETER2    0xc74
#define ROFDM0_AGCRSSITABLE     0xc78
#define ROFDM0_HTSTFAGC       0xc7c

#define ROFDM0_XATXIQIMBALANCE    0xc80
#define ROFDM0_XATXAFE        0xc84
#define ROFDM0_XBTXIQIMBALANCE    0xc88
#define ROFDM0_XBTXAFE        0xc8c
#define ROFDM0_XCTXIQIMBALANCE    0xc90
#define ROFDM0_XCTXAFE      0xc94
#define ROFDM0_XDTXIQIMBALANCE    0xc98
#define ROFDM0_XDTXAFE        0xc9c

#define ROFDM0_RXIQEXTANTA      0xca0

#define ROFDM0_RXHPPARAMETER    0xce0
#define ROFDM0_TXPSEUDONOISEWGT   0xce4
#define ROFDM0_FRAMESYNC      0xcf0
#define ROFDM0_DFSREPORT      0xcf4
#define ROFDM0_TXCOEFF1       0xca4
#define ROFDM0_TXCOEFF2       0xca8
#define ROFDM0_TXCOEFF3       0xcac
#define ROFDM0_TXCOEFF4       0xcb0
#define ROFDM0_TXCOEFF5       0xcb4
#define ROFDM0_TXCOEFF6       0xcb8

#define ROFDM1_LSTF         0xd00
#define ROFDM1_TRXPATHENABLE    0xd04

#define ROFDM1_CF0          0xd08
#define ROFDM1_CSI1         0xd10
#define ROFDM1_SBD          0xd14
#define ROFDM1_CSI2         0xd18
#define ROFDM1_CFOTRACKING      0xd2c
#define ROFDM1_TRXMESAURE1      0xd34
#define ROFDM1_INTFDET        0xd3c
#define ROFDM1_PSEUDONOISESTATEAB 0xd50
#define ROFDM1_PSEUDONOISESTATECD 0xd54
#define ROFDM1_RXPSEUDONOISEWGT   0xd58

#define ROFDM_PHYCOUNTER1     0xda0
#define ROFDM_PHYCOUNTER2     0xda4
#define ROFDM_PHYCOUNTER3     0xda8

#define ROFDM_SHORTCFOAB      0xdac
#define ROFDM_SHORTCFOCD      0xdb0
#define ROFDM_LONGCFOAB       0xdb4
#define ROFDM_LONGCFOCD       0xdb8
#define ROFDM_TAILCF0AB       0xdbc
#define ROFDM_TAILCF0CD       0xdc0
#define ROFDM_PWMEASURE1    0xdc4
#define ROFDM_PWMEASURE2    0xdc8
#define ROFDM_BWREPORT        0xdcc
#define ROFDM_AGCREPORT       0xdd0
#define ROFDM_RXSNR         0xdd4
#define ROFDM_RXEVMCSI        0xdd8
#define ROFDM_SIGREPORT       0xddc

#define RTXAGC_A_RATE18_06      0xe00
#define RTXAGC_A_RATE54_24      0xe04
#define RTXAGC_A_CCK1_MCS32     0xe08
#define RTXAGC_A_MCS03_MCS00    0xe10
#define RTXAGC_A_MCS07_MCS04    0xe14
#define RTXAGC_A_MCS11_MCS08    0xe18
#define RTXAGC_A_MCS15_MCS12    0xe1c

#define RTXAGC_B_RATE18_06      0x830
#define RTXAGC_B_RATE54_24      0x834
#define RTXAGC_B_CCK1_55_MCS32    0x838
#define RTXAGC_B_MCS03_MCS00    0x83c
#define RTXAGC_B_MCS07_MCS04    0x848
#define RTXAGC_B_MCS11_MCS08    0x84c
#define RTXAGC_B_MCS15_MCS12    0x868
#define RTXAGC_B_CCK11_A_CCK2_11  0x86c

#define RZEBRA1_HSSIENABLE      0x0
#define RZEBRA1_TRXENABLE1      0x1
#define RZEBRA1_TRXENABLE2      0x2
#define RZEBRA1_AGC         0x4
#define RZEBRA1_CHARGEPUMP      0x5
#define RZEBRA1_CHANNEL       0x7

#define RZEBRA1_TXGAIN        0x8
#define RZEBRA1_TXLPF       0x9
#define RZEBRA1_RXLPF       0xb
#define RZEBRA1_RXHPFCORNER     0xc

#define RGLOBALCTRL         0
#define RRTL8256_TXLPF        19
#define RRTL8256_RXLPF        11
#define RRTL8258_TXLPF        0x11
#define RRTL8258_RXLPF        0x13
#define RRTL8258_RSSILPF      0xa

