torvalds/linux/drivers/net/wireless/realtek/rtlwifi/rtl8723ae/reg.h
#define RF_AC           0x00

#define RF_IQADJ_G1         0x01
#define RF_IQADJ_G2         0x02
#define RF_POW_TRSW         0x05

#define RF_GAIN_RX          0x06
#define RF_GAIN_TX          0x07

#define RF_TXM_IDAC         0x08
#define RF_BS_IQGEN         0x0F

#define RF_MODE1          0x10
#define RF_MODE2          0x11

#define RF_RX_AGC_HP        0x12
#define RF_TX_AGC         0x13
#define RF_BIAS           0x14
#define RF_IPA            0x15
#define RF_POW_ABILITY        0x17
#define RF_MODE_AG          0x18
#define RRFCHANNEL          0x18
#define RF_CHNLBW         0x18
#define RF_TOP            0x19

#define RF_RX_G1          0x1A
#define RF_RX_G2          0x1B

#define RF_RX_BB2         0x1C
#define RF_RX_BB1         0x1D

#define RF_RCK1           0x1E
#define RF_RCK2           0x1F

#define RF_TX_G1          0x20
#define RF_TX_G2          0x21
#define RF_TX_G3          0x22

#define RF_TX_BB1         0x23
#define RF_T_METER          0x24

#define RF_SYN_G1         0x25
#define RF_SYN_G2         0x26
#define RF_SYN_G3         0x27
#define RF_SYN_G4         0x28
#define RF_SYN_G5         0x29
#define RF_SYN_G6         0x2A
#define RF_SYN_G7         0x2B
#define RF_SYN_G8         0x2C

#define RF_RCK_OS         0x30
#define RF_TXPA_G1          0x31
#define RF_TXPA_G2          0x32
#define RF_TXPA_G3          0x33

#define BBBRESETB         0x100
#define BGLOBALRESETB       0x200
#define BOFDMTXSTART        0x4
#define BCCKTXSTART         0x8
#define BCRC32DEBUG         0x100
#define BPMACLOOPBACK       0x10
#define BTXLSIG           0xffffff
#define BOFDMTXRATE         0xf
#define BOFDMTXRESERVED       0x10
#define BOFDMTXLENGTH       0x1ffe0
#define BOFDMTXPARITY       0x20000
#define BTXHTSIG1         0xffffff
#define BTXHTMCSRATE        0x7f
#define BTXHTBW           0x80
#define BTXHTLENGTH         0xffff00
#define BTXHTSIG2         0xffffff
#define BTXHTSMOOTHING        0x1
#define BTXHTSOUNDING       0x2
#define BTXHTRESERVED       0x4
#define BTXHTAGGREATION       0x8
#define BTXHTSTBC         0x30
#define BTXHTADVANCECODING      0x40
#define BTXHTSHORTGI        0x80
#define BTXHTNUMBERHT_LTF     0x300
#define BTXHTCRC8         0x3fc00
#define BCOUNTERRESET       0x10000
#define BNUMOFOFDMTX        0xffff
#define BNUMOFCCKTX         0xffff0000
#define BTXIDLEINTERVAL       0xffff
#define BOFDMSERVICE        0xffff0000
#define BTXMACHEADER        0xffffffff
#define BTXDATAINIT         0xff
#define BTXHTMODE         0x100
#define BTXDATATYPE         0x30000
#define BTXRANDOMSEED       0xffffffff
#define BCCKTXPREAMBLE        0x1
#define BCCKTXSFD         0xffff0000
#define BCCKTXSIG         0xff
#define BCCKTXSERVICE       0xff00
#define BCCKLENGTHEXT       0x8000
#define BCCKTXLENGHT        0xffff0000
#define BCCKTXCRC16         0xffff
#define BCCKTXSTATUS        0x1
#define BOFDMTXSTATUS       0x2
#define IS_BB_REG_OFFSET_92S(_offset) \
  ((_offset >= 0x800) && (_offset <= 0xfff))

#define BRFMOD            0x1
#define BJAPANMODE          0x2
#define BCCKTXSC          0x30
#define BCCKEN            0x1000000
#define BOFDMEN           0x2000000

#define BOFDMRXADCPHASE     0x10000
#define BOFDMTXDACPHASE     0x40000
#define BXATXAGC      0x3f

#define BXBTXAGC      0xf00
#define BXCTXAGC      0xf000
#define BXDTXAGC      0xf0000

#define BPASTART      0xf0000000
#define BTRSTART      0x00f00000
#define BRFSTART      0x0000f000
#define BBBSTART      0x000000f0
#define BBBCCKSTART     0x0000000f
#define BPAEND        0xf
#define BTREND        0x0f000000
#define BRFEND        0x000f0000
#define BCCAMASK      0x000000f0
#define BR2RCCAMASK     0x00000f00
#define BHSSI_R2TDELAY      0xf8000000
#define BHSSI_T2RDELAY      0xf80000
#define BCONTXHSSI      0x400
#define BIGFROMCCK      0x200
#define BAGCADDRESS     0x3f
#define BRXHPTX       0x7000
#define BRXHP2RX      0x38000
#define BRXHPCCKINI     0xc0000
#define BAGCTXCODE      0xc00000
#define BAGCRXCODE      0x300000

#define B3WIREDATALENGTH    0x800
#define B3WIREADDREAALENGTH   0x400

#define B3WIRERFPOWERDOWN   0x1
#define B5GPAPEPOLARITY     0x40000000
#define B2GPAPEPOLARITY     0x80000000
#define BRFSW_TXDEFAULTANT    0x3
#define BRFSW_TXOPTIONANT   0x30
#define BRFSW_RXDEFAULTANT    0x300
#define BRFSW_RXOPTIONANT   0x3000
#define BRFSI_3WIREDATA     0x1
#define BRFSI_3WIRECLOCK    0x2
#define BRFSI_3WIRELOAD     0x4
#define BRFSI_3WIRERW     0x8
#define BRFSI_3WIRE     0xf

#define BRFSI_RFENV     0x10

#define BRFSI_TRSW      0x20
#define BRFSI_TRSWB     0x40
#define BRFSI_ANTSW     0x100
#define BRFSI_ANTSWB      0x200
#define BRFSI_PAPE      0x400
#define BRFSI_PAPE5G      0x800
#define BBANDSELECT     0x1
#define BHTSIG2_GI      0x80
#define BHTSIG2_SMOOTHING   0x01
#define BHTSIG2_SOUNDING    0x02
#define BHTSIG2_AGGREATON   0x08
#define BHTSIG2_STBC      0x30
#define BHTSIG2_ADVCODING   0x40
#define BHTSIG2_NUMOFHTLTF    0x300
#define BHTSIG2_CRC8      0x3fc
#define BHTSIG1_MCS     0x7f
#define BHTSIG1_BANDWIDTH   0x80
#define BHTSIG1_HTLENGTH    0xffff
#define BLSIG_RATE      0xf
#define BLSIG_RESERVED      0x10
#define BLSIG_LENGTH      0x1fffe
#define BLSIG_PARITY      0x20
#define BCCKRXPHASE     0x4

#define BLSSIREADADDRESS    0x7f800000
#define BLSSIREADEDGE     0x80000000

#define BLSSIREADBACKDATA   0xfffff

#define BLSSIREADOKFLAG     0x1000
#define BCCKSAMPLERATE      0x8
#define BREGULATOR0STANDBY    0x1
#define BREGULATORPLLSTANDBY    0x2
#define BREGULATOR1STANDBY    0x4
#define BPLLPOWERUP     0x8
#define BDPLLPOWERUP      0x10
#define BDA10POWERUP      0x20
#define BAD7POWERUP     0x200
#define BDA6POWERUP     0x2000
#define BXTALPOWERUP      0x4000
#define B40MDCLKPOWERUP     0x8000
#define BDA6DEBUGMODE     0x20000
#define BDA6SWING     0x380000

#define BADCLKPHASE     0x4000000
#define B80MCLKDELAY      0x18000000
#define BAFEWATCHDOGENABLE    0x20000000

#define BXTALCAP01      0xc0000000
#define BXTALCAP23      0x3
#define BXTALCAP92X         0x0f000000
#define BXTALCAP      0x0f000000

#define BINTDIFCLKENABLE    0x400
#define BEXTSIGCLKENABLE    0x800
#define BBANDGAP_MBIAS_POWERUP      0x10000
#define BAD11SH_GAIN      0xc0000
#define BAD11NPUT_RANGE     0x700000
#define BAD110P_CURRENT     0x3800000
#define BLPATH_LOOPBACK     0x4000000
#define BQPATH_LOOPBACK     0x8000000
#define BAFE_LOOPBACK     0x10000000
#define BDA10_SWING     0x7e0
#define BDA10_REVERSE     0x800
#define BDA_CLK_SOURCE              0x1000
#define BDA7INPUT_RANGE     0x6000
#define BDA7_GAIN     0x38000
#define BDA7OUTPUT_CM_MODE          0x40000
#define BDA7INPUT_CM_MODE           0x380000
#define BDA7CURRENT     0xc00000
#define BREGULATOR_ADJUST   0x7000000
#define BAD11POWERUP_ATTX   0x1
#define BDA10PS_ATTX      0x10
#define BAD11POWERUP_ATRX   0x100
#define BDA10PS_ATRX      0x1000
#define BCCKRX_AGC_FORMAT           0x200
#define BPSDFFT_SAMPLE_POINT    0xc000
#define BPSD_AVERAGE_NUM            0x3000
#define BIQPATH_CONTROL     0xc00
#define BPSD_FREQ     0x3ff
#define BPSD_ANTENNA_PATH           0x30
#define BPSD_IQ_SWITCH              0x40
#define BPSD_RX_TRIGGER             0x400000
#define BPSD_TX_TRIGGER             0x80000000
#define BPSD_SINE_TONE_SCALE        0x7f000000
#define BPSD_REPORT     0xffff

