torvalds/linux/drivers/net/wireless/realtek/rtlwifi/rtl8723ae/reg.h
#define BNOISE_LVL_TOP_SET          0x3
#define BCHSMOOTH     0x4
#define BCHSMOOTH_CFG1      0x38
#define BCHSMOOTH_CFG2      0x1c0
#define BCHSMOOTH_CFG3      0xe00
#define BCHSMOOTH_CFG4      0x7000
#define BMRCMODE      0x800000
#define BTHEVMCFG     0x7000000

#define BLOOP_FIT_TYPE      0x1
#define BUPD_CFO      0x40
#define BUPD_CFO_OFFDATA    0x80
#define BADV_UPD_CFO      0x100
#define BADV_TIME_CTRL      0x800
#define BUPD_CLKO     0x1000
#define BFC       0x6000
#define BTRACKING_MODE      0x8000
#define BPHCMP_ENABLE     0x10000
#define BUPD_CLKO_LTF     0x20000
#define BCOM_CH_CFO     0x40000
#define BCSI_ESTI_MODE      0x80000
#define BADV_UPD_EQZ      0x100000
#define BUCHCFG       0x7000000
#define BUPDEQZ       0x8000000

#define BRX_PESUDO_NOISE_ON         0x20000000
#define BRX_PESUDO_NOISE_A    0xff
#define BRX_PESUDO_NOISE_B    0xff00
#define BRX_PESUDO_NOISE_C    0xff0000
#define BRX_PESUDO_NOISE_D    0xff000000
#define BRX_PESUDO_NOISESTATE_A     0xffff
#define BRX_PESUDO_NOISESTATE_B     0xffff0000
#define BRX_PESUDO_NOISESTATE_C     0xffff
#define BRX_PESUDO_NOISESTATE_D     0xffff0000

#define BZEBRA1_HSSIENABLE    0x8
#define BZEBRA1_TRXCONTROL    0xc00
#define BZEBRA1_TRXGAINSETTING    0x07f
#define BZEBRA1_RXCOUNTER   0xc00
#define BZEBRA1_TXCHANGEPUMP    0x38
#define BZEBRA1_RXCHANGEPUMP    0x7
#define BZEBRA1_CHANNEL_NUM   0xf80
#define BZEBRA1_TXLPFBW     0x400
#define BZEBRA1_RXLPFBW     0x600

#define BRTL8256REG_MODE_CTRL1      0x100
#define BRTL8256REG_MODE_CTRL0      0x40
#define BRTL8256REG_TXLPFBW         0x18
#define BRTL8256REG_RXLPFBW         0x600

#define BRTL8258_TXLPFBW    0xc
#define BRTL8258_RXLPFBW    0xc00
#define BRTL8258_RSSILPFBW    0xc0

#define BBYTE0        0x1
#define BBYTE1        0x2
#define BBYTE2        0x4
#define BBYTE3        0x8
#define BWORD0        0x3
#define BWORD1        0xc
#define BWORD       0xf

#define MASKBYTE0     0xff
#define MASKBYTE1     0xff00
#define MASKBYTE2     0xff0000
#define MASKBYTE3     0xff000000
#define MASKHWORD     0xffff0000
#define MASKLWORD     0x0000ffff
#define MASKDWORD         0xffffffff
#define MASK12BITS          0xfff
#define MASKH4BITS          0xf0000000
#define MASKOFDM_D          0xffc00000
#define MASKCCK           0x3f3f3f3f

#define MASK4BITS     0x0f
#define MASK20BITS      0xfffff
#define RFREG_OFFSET_MASK     0xfffff

#define BENABLE       0x1
#define BDISABLE      0x0

#define LEFT_ANTENNA      0x0
#define RIGHT_ANTENNA     0x1

#define TCHECK_TXSTATUS     500
#define TUPDATE_RXCOUNTER   100

/* 2 EFUSE_TEST (For RTL8723 partially) */
#define EFUSE_SEL(x)          (((x) & 0x3) << 8)
#define EFUSE_SEL_MASK        0x300
#define EFUSE_WIFI_SEL_0        0x0
/* Enable GPIO[9] as WiFi HW PDn source*/
#define WL_HWPDN_EN         BIT(0)
/* WiFi HW PDn polarity control*/
#define WL_HWPDN_SL         BIT(1)

#endif
